mikeakohn/naken_asm/include/8051/stc8cxx.inc
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; STC8Cxx include
;; part of the naken_asm assembler
;;
;; Generated by: Cjacker Huang (cjacker@gmail.com)
;;         Date: 2022-05-21
;;        Parts: STC8Cxx
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

INTCLKO equ 0x8F
P1M1 equ 0x91
P1M0 equ 0x92
P0M1 equ 0x93
P0M0 equ 0x94
P2M1 equ 0x95
P2M0 equ 0x96
S2CON equ 0x9A
S2BUF equ 0x9B
IRCBAND equ 0x9D
LIRTRIM equ 0x9E
IRTRIM equ 0x9F
BUS_SPEED equ 0xA1
P_SW1 equ 0xA2
SADDR equ 0xA9
WKTCL equ 0xAA
WKTCH equ 0xAB
TA equ 0xAE
IE2 equ 0xAF
P3M1 equ 0xB1
P3M0 equ 0xB2
P4M1 equ 0xB3
P4M0 equ 0xB4
IP2 equ 0xB5
IP2H equ 0xB6
IPH equ 0xB7
SADEN equ 0xB9
P_SW2 equ 0xBA
WDT_CONTR equ 0xC1
IAP_DATA equ 0xC2
IAP_ADDRH equ 0xC3
IAP_ADDRL equ 0xC4
IAP_CMD equ 0xC5
IAP_TRIG equ 0xC6
IAP_CONTR equ 0xC7
P5M1 equ 0xC9
P5M0 equ 0xCA
SPSTAT equ 0xCD
SPCTL equ 0xCE
SPDAT equ 0xCF
T4T3M equ 0xD1
T4H equ 0xD2
T4L equ 0xD3
T3H equ 0xD4
T3L equ 0xD5
T2H equ 0xD6
IP3 equ 0xDF
DPS equ 0xE3
DPL1 equ 0xE4
DPH1 equ 0xE5
CMPCR1 equ 0xE6
CMPCR2 equ 0xE7
IP3H equ 0xEE
AUXINTIF equ 0xEF
IAP_TPS equ 0xF5
RSTCFG equ 0xFF

; xdata

CKSEL equ 0xfe00
CLKDIV equ 0xfe01
HIRCCR equ 0xfe02
XOSCCR equ 0xfe03
IRC32KCR equ 0xfe04
MCLKOCR equ 0xfe05
IRCDB equ 0xfe06
P0PU equ 0xfe10
P1PU equ 0xfe11
P2PU equ 0xfe12
P3PU equ 0xfe13
P4PU equ 0xfe14
P5PU equ 0xfe15
P0NCS equ 0xfe18
P1NCS equ 0xfe19
P2NCS equ 0xfe1a
P3NCS equ 0xfe1b
P4NCS equ 0xfe1c
P5NCS equ 0xfe1d
P0SR equ 0xfe20
P1SR equ 0xfe21
P2SR equ 0xfe22
P3SR equ 0xfe23
P4SR equ 0xfe24
P5SR equ 0xfe25
P0DR equ 0xfe28
P1DR equ 0xfe29
P2DR equ 0xfe2a
P3DR equ 0xfe2b
P4DR equ 0xfe2c
P5DR equ 0xfe2d
P0IE equ 0xfe30
P1IE equ 0xfe31
I2CCFG equ 0xfe80
I2CMSCR equ 0xfe81
I2CMSST equ 0xfe82
I2CSLCR equ 0xfe83
I2CSLST equ 0xfe84
I2CSLADR equ 0xfe85
I2CTXD equ 0xfe86
I2CRXD equ 0xfe87
I2CMSAUX equ 0xfe88
TM2PS equ 0xfea2
TM3PS equ 0xfea3
TM4PS equ 0xfea4
P0INTE equ 0xfd00
P1INTE equ 0xfd01
P2INTE equ 0xfd02
P3INTE equ 0xfd03
P4INTE equ 0xfd04
P5INTE equ 0xfd05
P0INTF equ 0xfd10
P1INTF equ 0xfd11
P2INTF equ 0xfd12
P3INTF equ 0xfd13
P4INTF equ 0xfd14
P5INTF equ 0xfd15
P0IM0 equ 0xfd20
P1IM0 equ 0xfd21
P2IM0 equ 0xfd22
P3IM0 equ 0xfd23
P4IM0 equ 0xfd24
P5IM0 equ 0xfd25
P0IM1 equ 0xfd30
P1IM1 equ 0xfd31
P2IM1 equ 0xfd32
P3IM1 equ 0xfd33
P4IM1 equ 0xfd34
P5IM1 equ 0xfd35
MD3 equ 0xfcf0
MD2 equ 0xfcf1
MD1 equ 0xfcf2
MD0 equ 0xfcf3
MD5 equ 0xfcf4
MD4 equ 0xfcf5
ARCON equ 0xfcf6
OPCON equ 0xfcf7
